[
  {
    "number": 1,
    "paragraph": {
      "number": "סימן א",
      "title": "בענין מצות שמירת המקדש אם נוהג בזמן הזה. באור החפצא של שמירה אם הוא דין בפלטרין של המקדש דרך כבוד או שעיקר השמירה שלא יכנום בה זר וטמא. באור השיטות אם חיוב השמירה הוא רק בלילה או גם ביום."
    },
    "pages": { "page1": 1, "page2": 5 }
  },
  {
    "number": 2,
    "paragraph": {
      "number": "סימן ב",
      "title": "בירורים ופלפולים אם שמירת המקדש מקרי עבודה."
    },
    "pages": { "page1": 5, "page2": 10 }
  },
  {
    "number": 3,
    "paragraph": {
      "number": "סימן ג",
      "title": "פלפול במחלוקת הרמב״ם והראב״ד בענין כהנים שלבשו בגדי כהונה שלא בשעת עבודה אם לוקים דלשטתיהו אזלי.\t"
    },
    "pages": { "page1": 10, "page2": 15 }
  },
  {
    "number": 4,
    "paragraph": {
      "number": "סימן ד",
      "title": "בפטור מתעסק אם רק בדבר שיש מעשה או אפילו מידי דממילא ויבאר מחלוקת הגרע״א והנתיבות ומפלפל בדבריהם טובא."
    },
    "pages": { "page1": 15, "page2": 25 }
  },
  {
    "number": 5,
    "paragraph": {
      "number": "סימן ה",
      "title": "דן אם מתעסק פתיכא בו גם ענין של אונס. באור דברי הראב״ד בפ״ז מהלכות מעילה הלכה ב׳. באוד דבריהם התמוהים של התוספות במעילה י״ח. ובירור אם אמרינן באונס אין שליח לדבר עבירה."
    },
    "pages": { "page1": 25, "page2": 29 }
  },
  {
    "number": 6,
    "paragraph": {
      "number": "סימן ו",
      "title": "בענין קלבד״מ וקנין גזילה. באור הסוגיא דסנהדרין ע״ב מפלפל בענין קנין גזילה לבאר דרב לשטתיה אזיל בב״ק קט״ו. באורים בפלוגתת הראשונים בשנוי רשות ואח״כF יאוש אי קנה הגזלן וכן בהקדש אס נקרא הגזלן מקדיש."
    },
    "pages": { "page1": 29, "page2": 35 }
  },
  {
    "number": 7,
    "paragraph": {
      "number": "סימן ז",
      "title": "בענין כותל המערבי שלפי כמה פוסקים הוא כותל העזרה. באור דברי הרדב״ז בארוכה. וביאור דין גגין ועליות שלא נתקדשו אם זה דוקא באותן שהיו בשעת קידוש. פלפולים וביאורים בענין זה. "
    },
    "pages": { "page1": 35, "page2": 46 }
  },
  {
    "number": 8,
    "paragraph": {
      "number": "סימן ח",
      "title": "בענין טבול יום בהר הבית. ביאורים להלכה האם מותר לטבול יום לעלות להר הבית.\t"
    },
    "pages": { "page1": 46, "page2": 50 }
  },
  {
    "number": 9,
    "paragraph": {
      "number": "סימן ט",
      "title": "בדין שמירת לוים אם בעינן לוי מיוחס. ביאור בדין שמירת לוים אם בעינן לוי מיוחס ופלפול במה שאין טומאת נגעים נוהג בזמן הזה.\t"
    },
    "pages": { "page1": 50, "page2": 51 }
  },
  {
    "number": 10,
    "paragraph": {
      "number": "סימן י",
      "title": "פלפול בדין פקו״נ שדוחה מילה.\t"
    },
    "pages": { "page1": 51, "page2": 52 }
  },
  {
    "number": 11,
    "paragraph": {
      "number": "סימן יא",
      "title": "בענין ספק דאורייתא מדאורייתא לקולא. שקלא וטריא בדברי האחרונים בדעת הרמב״ם שספק מן התורה לקולא אם הוא רק בספק איסור או גם בספק עשה. דבר חדש בספק דאורייתא שמן התורה לקולא ורק מדרבנן לחומרא לדעת הרמב״ם במקום שאין תקנה לא אמרינן לחומרא מדרבנן ואוקמוה על דאורייתא."
    },
    "pages": { "page1": 52, "page2": 56 }
  },
  {
    "number": 12,
    "paragraph": {
      "number": "סימן יב",
      "title": "יישוב דברי החוות דעת. ישוב דברי החוות דעת ממה שתמהו עליו מהגמרא דחולין ומנחות. עוד בשיטת החוות דעת ובענין פסול משקה ישראל ונעבד בקרבן. פלפול בסוגיא דתמורה כ״ט.\t"
    },
    "pages": { "page1": 56, "page2": 61 }
  },
  {
    "number": 13,
    "paragraph": {
      "number": "סימן יג",
      "title": "בענין זה וזה גורם באיסורי אכילה ובאיסורי הנאה. ישוב לדברי רש״י בתמורה ל׳ ממה שקשה עליו מסוגיא מפורשת בחולין. פלפול בדברי רבינו גרשום בביאור הגמרא דבכורות ז׳ בענין זה וזה גורם."
    },
    "pages": { "page1": 61, "page2": 64 }
  },
  {
    "number": 14,
    "paragraph": {
      "number": "סימן יד",
      "title": "בדין ביטול ברוב לענין טבל והקדש. חידושים וביאורים ביסוד הדין מה נקרא ניכר האיסור שאינו בטל ברוב. מחלוקת ר״י וריש לקיש בירושלמי מה נקרא ניכר האיסור מבאר דר״י ור״ל לשטתייהו אזלי. ובאור נפלא בדברי הרמב״ם בפט״ו מהלכות מאכלות אסורות הל״י והל׳ י״ב.\t"
    },
    "pages": { "page1": 64, "page2": 68 }
  },
  {
    "number": 15,
    "paragraph": {
      "number": "סימן טו",
      "title": "בענין איסורי ע״ז. פלפול וביאור הסוגיא דעבודה זרה מ״ז. בענין איסור ע״ז במחובר ובעלי חיים ותלוש ובדין תפיסת ידי אדם לגבי ע״ז ובגדרי נעבד לענין קרבן. "
    },
    "pages": { "page1": 68, "page2": 78 }
  },
  {
    "number": 16,
    "paragraph": {
      "number": "סימן טז",
      "title": "בענין כהן מיוחס. פלפולים ובירורים להלכה בענין כהן מיוחס ובדין חזקת כהנים ולוים בזמן הזה."
    },
    "pages": { "page1": 78, "page2": 90 }
  },
  {
    "number": 17,
    "paragraph": {
      "number": "סימן יז",
      "title": "באורים וחידושים בענין רוב וחזקה. "
    },
    "pages": { "page1": 90, "page2": 102 }
  },
  {
    "number": 18,
    "paragraph": {
      "number": "סימן יח",
      "title": "בענין זכירת יציאת מצרים לעתיד לבא. באור דברי הרשב״א בענין אם מזכירים יציאת מצרים לעתיד לבא. הזכרת יציאת מצרים צריכה להיות בדבור ולא במחשבה. ישוב דעת הנוב״י בענין נוסח לשם יחוד אשר השיג עליו בשער התפלה. בדין לשמה בקרבנות ובס״ת אם צריך דבור. ביאור דברי הראשונים בדין מצות צריכות כונה אם סגי במחשבה."
    },
    "pages": { "page1": 102, "page2": 120 }
  },
  {
    "number": 19,
    "paragraph": {
      "number": "סימן יט",
      "title": "בענין זכר לנס בחנוכה ופורים. דברי ההלכות גדולות שסוברים שצריך לעשות זכר לנס בחנוכה ופורים שהאריכו בהם הרמב״ם והרמב״ן בספר המצות. שקלא וטריא בדברי הח״ס בביאור דברי ההלכות גדולות. ישוב להשגת העמק שאלה על הח״ס ויבאר ששיטת הח״ס משנת ראשונים היא זו. באור הסוגיא דשבת כ״א. באור הגמרא דפסחים קי״ח.\t"
    },
    "pages": { "page1": 120, "page2": 127 }
  },
  {
    "number": 20,
    "paragraph": {
      "number": "סימן כ",
      "title": "בדברי הגר״ח בשירה על הנס. באור דברי הגר״ח בענין שירה על הנס ומה שקשה עליו ממכילתא ומדברי השל״ה הקדוש וישוב דברי הגר״ח. באור הגמרא בברכות לענין שירה על הנס. תירוץ לקושית המהרש״א. ובאור דברי המגילת תענית שהניח בתוספות חדשים בצריך עיון גדול. דברי הצל״ח בזה' יש הבדל בין שירה לשעה לשירה לדורות."
    },
    "pages": { "page1": 127, "page2": 133 }
  },
  {
    "number": 21,
    "paragraph": {
      "number": "סימן כא",
      "title": "באור בגמרא שבת. לפי האמור יוצא ביאור נפלא בגמרא שבת י״ג. באור פלוגתת רבינו אברהם בנו של הרמב״ם ז״ל עם רבינו דניאל הבבלי. באור דברי הרמב״ן בספר המצות שמסתפק אם הלל היא הלכה למשה מסיני מדין שירה על הנס או מדין שמחה ביו״ט. "
    },
    "pages": { "page1": 133, "page2": 139 }
  },
  {
    "number": 22,
    "paragraph": {
      "number": "סימן כב",
      "title": "בענין ידיעה וראיה. שירה לדורות תלוי בידיעה. באור דברי הרמב״ם בהקדמה ליד החזקה לענין קבלת אחיה השילוני. באור חדש ונפלא בדברי הרמב״ם מזקני הגאון ר׳ אברהם יצחק הלוי צימרמן זצ״ל. ישוב המרדני בענין נאמנות עד אחד שתמה עליו בפ״מ ועפ״י דבריו מתיישבת סוגיא חמורה בר״ה."
    },
    "pages": { "page1": 139, "page2": 148 }
  },
  {
    "number": 23,
    "paragraph": {
      "number": "סימן כג",
      "title": "בענין מקרא קודש. באור דברי הרמב״ן פ׳ אמור בפירוש מקראי קודש. באור ופלפול בדברי רבינו נחשון גאון הובאו במרדכי שאסור להתענות בר״ה שנאמר מקראי קודש ממה שקשה עליו מהסוגיא דביצה וישוב נפלא על זה•\t"
    },
    "pages": { "page1": 148, "page2": 152 }
  },
  {
    "number": 24,
    "paragraph": {
      "number": "סימן כד",
      "title": "ענין שמחת יו״ט בר״ה. בבאור דברי הגאונים הסוברים שמותר להתענות בר״ה. המאירי חולק עליהם. בדין עונג שבת ושמחת יו״ט. יבואר מחלוקת ר״א ור״י דר״א סובר דאמרינן ביו״ט כולו לד׳ או כולו לכם ור׳ יהושע סובר חציו לד׳ וחציו לכם. פלפול בדברי הישועות יעקב בענין זה. שיטת הרא״ה על הרי״ף ברכות דהלל בימים שהיחיד גומר בהם את ההלל הם דאורייתא. שיטת רבינו דניאל הבבלי דדין שירה על הנם כמו חנוכה ופורים הוא דאורייתא.\t"
    },
    "pages": { "page1": 152, "page2": 166 }
  },
  {
    "number": 25,
    "paragraph": {
      "number": "סימן כה",
      "title": "חדוש בשיטת ההלכות גדולות. דבר מחודש בשיטת ההלכות גדולות. באור דברי הגר״א באו״ח סימן ח׳ סעיף ב׳ וישוב למה שתמהו עליו. ההגדרה של מידת חסידות. באור הסוגיא דשבת קי״ח בזה. באור חדש בשיטת הלכות גדולות במה שמנה בסה״ט מצוות"
    },
    "pages": { "page1": 166, "page2": 172 }
  },
  {
    "number": 26,
    "paragraph": {
      "number": "סימן כו",
      "title": "ישוב דברי הרמב״ם פ״ז מנזירות הט״ז. באור חריף בדברי הכ״מ והמגדל עוז אשר לכאורה נראין כדברי סתירה.\t"
    },
    "pages": { "page1": 172, "page2": 175 }
  },
  {
    "number": 27,
    "paragraph": {
      "number": "סימן כז",
      "title": "בדין מושבע ועומד מהר סיני. שקלא וטריא אם דין דרבנן או הנלמד משלש עשרה מדות נקרא מושבע ועומד מהר סיני נ״מ אם חלה שבועה על זה. באור תשובת הרמב״ם בעדן זה שסובר שרק מה שהוא מפורש בתורה נקרא מושבע ועומד מהר סיני. שיטת הרמב״ם בענין לא תסור. באור שיטת הר״ן בזה. דברי התשב״ץ בשיטת הרמב״ם. באור דבריו וישוב ההשגות שהשיגו עליו גדולי האחרונים. חילוק בין מה שנלמד בשלש עשרה מדות שהתורה נדרשת בהם לבין הלכה למשה מסיני.\t"
    },
    "pages": { "page1": 175, "page2": 185 }
  },
  {
    "number": 28,
    "paragraph": {
      "number": "סימן כח",
      "title": "בענין ערבות. בדין מוטב שיהיו שוגגין ואל יהיו מזידין. באור דברי הראשונים בזה. דברי היראים בעדן מצות תוכחה. מבואר מדבריו עדן מחודש לענין ערבות שיש שני דיני ערבות נ״מ לעדן דיני תוכחה. "
    },
    "pages": { "page1": 185, "page2": 196 }
  },
  {
    "number": 29,
    "paragraph": {
      "number": "סימן כט",
      "title": "בעדן נשבע להתענות בשבתות ויו״ט. באור דברי הרמב״ם וישוב ממה שתמה עליו הגאון בעל הדברי אמת הספרדי ז״ל. בענין דינים שלומדים מדברי קבלה יש מהם שהם דאורייתא ויש מהם שהם דרבנן ואותן שהם דאורייתא הוא הלכה למשה מסיני ואילו מה שהוא דרבנן הוא מתקנת וגזירת נביאים."
    },
    "pages": { "page1": 196, "page2": 201 }
  },
  {
    "number": 30,
    "paragraph": {
      "number": "סימן ל",
      "title": "בענין קדושת המקדש בזמן הזה. באור דברי הרמב״ם והראב״ד בדין נביא והכל בכתב.\t"
    },
    "pages": { "page1": 201, "page2": 206 }
  },
  {
    "number": 31,
    "paragraph": {
      "number": "סימן לא",
      "title": "בעדן באו פריצים וחיללוה. באור דברי הבעל המאור והתשב״ץ ישוב לקושית הרמב״ן על הרז״ה."
    },
    "pages": { "page1": 206, "page2": 213 }
  },
  {
    "number": 32,
    "paragraph": {
      "number": "סימן לב",
      "title": "בענין מצות בנין בית המקדש. באור דברי הרמב״ם בפרק א׳ ובפרק ו׳ מהלכות בית הבחירה."
    },
    "pages": { "page1": 213, "page2": 215 }
  },
  {
    "number": 33,
    "paragraph": {
      "number": "סימן לג",
      "title": "בענין קדושה הבאה מדין התפשטות. באור דברי הרמב״ם והראב״ד בפרק ט״ו ממעשה הקרבנות. "
    },
    "pages": { "page1": 215, "page2": 218 }
  },
  {
    "number": 34,
    "paragraph": {
      "number": "סימן לד",
      "title": "בענין גר שנתגייר כקטן שנולד דמי. חידושים ופלפולים בעדן גר שנתגייר כקטן שנולד דמי ישוב לקושית רבינו הש״ש על דברי הגור אריה לרבינו מהר״ל מפראג. "
    },
    "pages": { "page1": 218, "page2": 221 }
  },
  {
    "number": 35,
    "paragraph": {
      "number": "סימן לה",
      "title": "בעדן קדושת הגוף וקדושת דמים. בירורים וביאורים בעדן קדושת היכל ועזרה. קדושת ס״ת ותפילין אם מועיל בהם תנאי. חידושים ופלפולים בענין אין משנין מקדושה לקדושה.\t"
    },
    "pages": { "page1": 221, "page2": 234 }
  },
  {
    "number": 36,
    "paragraph": {
      "number": "סימן לו",
      "title": "כלי שרת אין מקדשין אלא מדעת. בעדן כלי שרת אין מקדשין אלא מדעת באור דברי הרמב״ם בפ״ד מהלכות קרבן פסח. באור דברי ירושלמי תמוה בפסחים עפ״י דרך החידוד. בדין קידוש קומץ מבאר פלוגתת רש״י והרמב״ם. יבואר דלשטתייהו אזלי. "
    },
    "pages": { "page1": 234, "page2": 241 }
  },
  {
    "number": 37,
    "paragraph": {
      "number": "סימן לז",
      "title": "בענין קדושת הגוף לא פקעה בכדי. בעדן קדושת סוכה ביאורים ופלפולים.\t"
    },
    "pages": { "page1": 241, "page2": 248 }
  },
  {
    "number": 38,
    "paragraph": {
      "number": "סימן לח",
      "title": "בעדן טומאת אוכלין באור נפלא בגמרא דשבת. "
    },
    "pages": { "page1": 248, "page2": 249 }
  },
  {
    "number": 39,
    "paragraph": {
      "number": "סימן לט",
      "title": "בעדן גירושין בעל כרחה על ידי שליח. דברי הירושלמי סוף גיטץ הובא בתוס׳ ובמה שתמהו בזה. תירוץ לכל הקושיות של האחרונים שתמהו על הירושלמי בדרך חידוד.\t"
    },
    "pages": { "page1": 249, "page2": 252 }
  },
  {
    "number": 40,
    "paragraph": {
      "number": "סימן מ",
      "title": "בדין פשיעה בשמירת עבדים וקרקעות ושטרי חוב. נראה בדעת הרמב״ם שמשני דינים פושע חייב מטעם מזיק דגרמי ומטעם מזיק דשמירה, ושני הטעמים מפורשים בראשונים א׳ ברמב״ן ושני ברשב״א הובא בשיטמ״ק ב״מ. אבל הראב״ד לשיטתו אזיל שחולק על שני הטעמים.\t"
    },
    "pages": { "page1": 252, "page2": 259 }
  },
  {
    "number": 41,
    "paragraph": {
      "number": "סימן מא",
      "title": "באור שיטת הרמב״ם בעדן כתיבת המשנה. ישוב להקושיא שתמה עליו המהר״י חאגיז ז״ל מגמרא מפורשת בגיטין ותמורה ומתרץ שהרמב״ם לשטתיה אזיל.\t"
    },
    "pages": { "page1": 260, "page2": 267 }
  },
  {
    "number": 42,
    "paragraph": {
      "number": "סימן מב",
      "title": "בעדן אם כל המקדש נקרא בירה. באור מחלוקת ר״י וריש לקיש בריש יומא ישוב לשתי קושיות הרש״ש שם שר״י וריש לקיש לטעמייהו אזלי. באור עדן בית הבחירה דין בית המקדש שלעתיד שיהא בידי שמים וישוב למה שיש לתמוה בזה. דין מלך הוא מדין בית הבחירה ועוד הרבה דברים עמוקים. "
    },
    "pages": { "page1": 267, "page2": 271 }
  }
]
